blog/blog.org
#+HUGO_BASE_DIR: ./
#+HUGO_SECTION: ./posts
#+HUGO_WEIGHT: auto
#+HUGO_AUTO_SET_LASTMOD: t

* Guides :@guides:
** Deploying Talos to Equinix :kubernetes:equinix:talos:
:PROPERTIES:
:EXPORT_FILE_NAME: deplying-talos-to-equinix
:EXPORT_DATE: 2021-02-03
:EXPORT_HUGO_MENU: :menu "main"
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :summary "From nodes to workloads on baremetal"
:END:
#+include: "../ii/equinix-metal-capi-talos-kubernetes/README.org"
* Scratch* Footnotes
** deploying talos
*** Introduction

In this guide we will launch a highly-available three Node Kubernetes cluster on Equinix Metal using Talos as the Node OS, as well as bootstrap, and controlPlane provider for Cluster-API.

- What is [[https://cluster-api.sigs.k8s.io/][Cluster-API]]? ::
#+begin_quote
Cluster API is a Kubernetes sub-project focused on providing declarative APIs and tooling to simplify provisioning, upgrading, and operating multiple Kubernetes clusters.
#+end_quote

- What is [[https://www.talos.dev/][Talos]]? ::
#+begin_quote
Talos is a modern OS designed to be secure, immutable, and minimal.
#+end_quote

- What is [[https://metal.equinix.com/][Equinix Metal]]? ::
#+begin_quote
A globally-available bare metal “as-a-service” that can be deployed and interconnected in minutes.
#+end_quote
The folks over at Equinix Metal have a wonderful heart for supporting Open Source communities.

- Why is this important? :: In general: Orchestrating a container based OS such as Talos ([[http://flatcar-linux.org/][Flatcar]], [[https://getfedora.org/coreos/][Fedora CoreOS]], or [[https://rancher.com/products/rancher/][RancherOS]]) shifts focus from the Nodes to the workloads. In terms of Talos: Currently the documentation for running an OS such as Talos in Equinix Metal for Kubernetes with Cluster-API is not so well documented and therefore inaccessible. It's important to fill in the gaps of knowledge.

*** Dependencies

What you'll need for this guide:

- [[https://github.com/talos-systems/talos/releases/tag/v0.8.1][talosctl]]

- [[https://kubernetes.io/docs/tasks/tools/install-kubectl/][kubectl]]

- [[https://github.com/packethost/packet-cli][packet-cli]]

- the ID and API token of existing Equinix Metal project

- an existing Kubernetes cluster with a public IP (such as [[http://kind.sigs.k8s.io/][kind]], [[https://minikube.sigs.k8s.io/][minikube]], or a cluster already on Equinix Metal)

*** Prelimiary steps

In order to talk to Equinix Metal, we'll export environment variables to configure resources and talk via ~packet-cli~.

Set the correct project to create and manage resources in:
#+begin_src tmate
  read -p 'PACKET_PROJECT_ID: ' PACKET_PROJECT_ID
#+end_src

The API key for your account or project:
#+begin_src tmate
  read -p 'PACKET_API_KEY: ' PACKET_API_KEY
#+end_src

Export the variables to be accessible from ~packet-cli~ and ~clusterctl~ later on:
#+begin_src tmate
  export PACKET_PROJECT_ID PACKET_API_KEY PACKET_TOKEN=$PACKET_API_KEY
#+end_src

In the existing cluster, a public LoadBalancer IP will be needed. I have already installed nginx-ingress in this cluster, which has got a Service with the cluster's elastic IP.
We'll need this IP address later for use in booting the servers.
If you have set up your existing cluster differently, it'll just need to be an IP that we can use.
#+begin_src tmate
  export LOAD_BALANCER_IP="$(kubectl -n nginx-ingress get svc nginx-ingress-ingress-nginx-controller -o=jsonpath='{.status.loadBalancer.ingress[0].ip}')"
#+end_src

*** Setting up Cluster-API

Install Talos providers for Cluster-API bootstrap and controlplane in your existing cluster:
#+begin_src tmate
  clusterctl init -b talos -c talos -i packet
#+end_src

This will install Talos's bootstrap and controlPlane controllers as well as the Packet / Equinix Metal infrastructure provider.

**Important** note:
- the ~bootstrap-talos~ controller in the ~cabpt-system~ namespace must be running a version greater than ~v0.2.0-alpha.8~. The version can be displayed in with ~clusterctl upgrade plan~ when it's installed.

