blog/content/blog/deplying-talos-to-equinix.md
+++
title = "Deploying Talos to Equinix"
author = ["Caleb Woodbine", "Andrew Rynhard"]
date = 2021-02-03
lastmod = 2021-03-10T15:48:17+13:00
tags = ["kubernetes", "equinix", "talos", "org"]
categories = ["guides"]
draft = false
summary = "From nodes to workloads on baremetal"
+++

## Introduction {#introduction}

In this guide we will launch a highly-available three Node Kubernetes cluster on Equinix Metal using Talos as the Node OS, as well as bootstrap, and controlPlane provider for Cluster-API.

What is [Cluster-API](https://cluster-api.sigs.k8s.io/)?
:

> Cluster API is a Kubernetes sub-project focused on providing declarative APIs and tooling to simplify provisioning, upgrading, and operating multiple Kubernetes clusters.

What is [Talos](https://www.talos.dev/)?
:

> Talos is a modern OS designed to be secure, immutable, and minimal.

What is [Equinix Metal](https://metal.equinix.com/)?
:

> A globally-available bare metal “as-a-service” that can be deployed and interconnected in minutes.

The folks over at Equinix Metal have a wonderful heart for supporting Open Source communities.

Why is this important?
: In general: Orchestrating a container based OS such as Talos ([Flatcar](http://flatcar-linux.org/), [Fedora CoreOS](https://getfedora.org/coreos/), or [RancherOS](https://rancher.com/products/rancher/)) shifts focus from the Nodes to the workloads. In terms of Talos: Currently the documentation for running an OS such as Talos in Equinix Metal for Kubernetes with Cluster-API is not so well documented and therefore inaccessible. It's important to fill in the gaps of knowledge.


## Dependencies {#dependencies}

What you'll need for this guide:

-   [talosctl](https://github.com/talos-systems/talos/releases/tag/v0.8.1)

-   [kubectl](https://kubernetes.io/docs/tasks/tools/install-kubectl/)

-   [packet-cli](https://github.com/packethost/packet-cli)

-   the ID and API token of existing Equinix Metal project

-   an existing Kubernetes cluster with a public IP (such as [kind](http://kind.sigs.k8s.io/), [minikube](https://minikube.sigs.k8s.io/), or a cluster already on Equinix Metal)


## Prelimiary steps {#prelimiary-steps}

In order to talk to Equinix Metal, we'll export environment variables to configure resources and talk via `packet-cli`.

Set the correct project to create and manage resources in:

```tmate
  read -p 'PACKET_PROJECT_ID: ' PACKET_PROJECT_ID
```

The API key for your account or project:

```tmate
  read -p 'PACKET_API_KEY: ' PACKET_API_KEY
```

Export the variables to be accessible from `packet-cli` and `clusterctl` later on:

```tmate
  export PACKET_PROJECT_ID PACKET_API_KEY PACKET_TOKEN=$PACKET_API_KEY
```

In the existing cluster, a public LoadBalancer IP will be needed. I have already installed nginx-ingress in this cluster, which has got a Service with the cluster's elastic IP.
We'll need this IP address later for use in booting the servers.
If you have set up your existing cluster differently, it'll just need to be an IP that we can use.

```tmate
  export LOAD_BALANCER_IP="$(kubectl -n nginx-ingress get svc nginx-ingress-ingress-nginx-controller -o=jsonpath='{.status.loadBalancer.ingress[0].ip}')"
```


## Setting up Cluster-API {#setting-up-cluster-api}

Install Talos providers for Cluster-API bootstrap and controlplane in your existing cluster:

```tmate
  clusterctl init -b talos -c talos -i packet
```

This will install Talos's bootstrap and controlPlane controllers as well as the Packet / Equinix Metal infrastructure provider.

****Important**** note:

-   the `bootstrap-talos` controller in the `cabpt-system` namespace must be running a version greater than `v0.2.0-alpha.8`. The version can be displayed in with `clusterctl upgrade plan` when it's installed.
