blog/blog.org
*** Setting up Matchbox

Currently, since Equinix Metal have **not** yet added support for Talos, it is necessary to install [[https://matchbox.psdn.io/][Matchbox]] to boot the servers (There is an [[https://github.com/packethost/packet-images/issues/26][issue]] in progress and [[https://feedback.equinixmetal.com/operating-systems/p/talos-as-officially-supported-operating-system][feedback]] for adding support).

- What is Matchbox? ::
#+begin_quote
Matchbox is a service that matches bare-metal machines to profiles that PXE boot and provision clusters.
#+end_quote

Here is the manifest for a basic matchbox installation:
#+begin_src yaml :tangle ./matchbox.yaml :comments none
  apiVersion: apps/v1
  kind: Deployment
  metadata:
    name: matchbox
  spec:
    replicas: 1
    strategy:
      rollingUpdate:
        maxUnavailable: 1
    selector:
      matchLabels:
        name: matchbox
    template:
      metadata:
        labels:
          name: matchbox
      spec:
        containers:
          - name: matchbox
            image: quay.io/poseidon/matchbox:v0.9.0
            env:
              - name: MATCHBOX_ADDRESS
                value: "0.0.0.0:8080"
              - name: MATCHBOX_LOG_LEVEL
                value: "debug"
            ports:
              - name: http
                containerPort: 8080
            livenessProbe:
              initialDelaySeconds: 5
              httpGet:
                path: /
                port: 8080
            resources:
              requests:
                cpu: 30m
                memory: 20Mi
              limits:
                cpu: 50m
                memory: 50Mi
            volumeMounts:
              - name: data
                mountPath: /var/lib/matchbox
              - name: assets
                mountPath: /var/lib/matchbox/assets
        volumes:
          - name: data
            hostPath:
              path: /var/local/matchbox/data
          - name: assets
            hostPath:
              path: /var/local/matchbox/assets
  ---
  apiVersion: v1
  kind: Service
  metadata:
    name: matchbox
    annotations:
      metallb.universe.tf/allow-shared-ip: nginx-ingress
  spec:
    type: LoadBalancer
    selector:
      name: matchbox
    ports:
      - name: http
        protocol: TCP
        port: 8080
        targetPort: 8080
#+end_src
Save it as ~matchbox.yaml~

The manifests above were inspired by the manifests in the [[https://github.com/poseidon/matchbox/tree/master/contrib/k8s][matchbox repo]].
For production it might be wise to use:
- an Ingress with full TLS
- a ReadWriteMany storage provider instead hostPath for scaling

With the manifests ready to go, we'll install Matchbox into the ~matchbox~ namespace on the existing cluster with the following commands:
#+begin_src tmate
  kubectl create ns matchbox
  kubectl -n matchbox apply -f ./matchbox.yaml
#+end_src

You may need to patch the ~Service.spec.externalIPs~ to have an IP to access it from if one is not populated:
#+begin_src tmate
  kubectl -n matchbox patch \
    service matchbox \
    -p "{\"spec\":{\"externalIPs\":[\"$LOAD_BALANCER_IP\"]}}"
#+end_src

Once the pod is live, We'll need to create a directory structure for storing Talos boot assets:
#+begin_src tmate
  kubectl -n matchbox exec -it \
    deployment/matchbox -- \
    mkdir -p /var/lib/matchbox/{profiles,groups} /var/lib/matchbox/assets/talos
#+end_src

Inside the Matchbox container, we'll download the Talos boot assets for Talos version 0.8.1 into the assets folder:
#+begin_src tmate
  kubectl -n matchbox exec -it \
    deployment/matchbox -- \
    wget -P /var/lib/matchbox/assets/talos \
    https://github.com/talos-systems/talos/releases/download/v0.8.1/initramfs-amd64.xz \
    https://github.com/talos-systems/talos/releases/download/v0.8.1/vmlinuz-amd64
#+end_src

Now that the assets have been downloaded, run a checksum against them to verify:
#+begin_src tmate
  kubectl -n matchbox exec -it \
    deployment/matchbox -- \
    sh -c "cd /var/lib/matchbox/assets/talos && \
      wget -O- https://github.com/talos-systems/talos/releases/download/v0.8.1/sha512sum.txt 2> /dev/null \
      | sed 's,_out/,,g' \
      | grep 'initramfs-amd64.xz\|vmlinuz-amd64' \
      | sha512sum -c -"
#+end_src

Since there's only one Pod in the Matchbox deployment, we'll export it's name to copy files into it:
#+begin_src tmate
  export MATCHBOX_POD_NAME=$(kubectl -n matchbox get pods -l name=matchbox -o=jsonpath='{.items[0].metadata.name}')
#+end_src

[[https://matchbox.psdn.io/matchbox/#profiles][Profiles in Matchbox]] are JSON configurations for how the servers should boot, where from, and their kernel args. Save this file as ~profile-default-amd64.json~
#+begin_src json :tangle ./profile-default-amd64.json :comments none
  {
    "id": "default-amd64",
    "name": "default-amd64",
    "boot": {
      "kernel": "/assets/talos/vmlinuz-amd64",
      "initrd": [
        "/assets/talos/initramfs-amd64.xz"
      ],
      "args": [
        "initrd=initramfs-amd64.xz",
        "init_on_alloc=1",
        "init_on_free=1",
        "slub_debug=P",
        "pti=on",
        "random.trust_cpu=on",
        "console=tty0",
        "console=ttyS1,115200n8",
        "slab_nomerge",
        "printk.devkmsg=on",
        "talos.platform=packet",
        "talos.config=none"
      ]
    }
  }
#+end_src

[[https://matchbox.psdn.io/matchbox/#groups][Groups in Matchbox]] are a way of letting servers pick up profiles based on selectors. Save this file as ~group-default-amd64.json~
#+begin_src json :tangle ./group-default-amd64.json :comments none
  {
    "id": "default-amd64",
    "name": "default-amd64",
    "profile": "default-amd64",
    "selector": {
      "arch": "amd64"
    }
  }
#+end_src

We'll copy the profile and group into their respective folders:
#+begin_src tmate
  kubectl -n matchbox \
    cp ./profile-default-amd64.json \
    $MATCHBOX_POD_NAME:/var/lib/matchbox/profiles/default-amd64.json
  kubectl -n matchbox \
    cp ./group-default-amd64.json \
    $MATCHBOX_POD_NAME:/var/lib/matchbox/groups/default-amd64.json
#+end_src

List the files to validate that they were written correctly:
#+begin_src tmate
  kubectl -n matchbox exec -it \
    deployment/matchbox -- \
    sh -c 'ls -alh /var/lib/matchbox/*/'
#+end_src

**** Testing Matchbox

Using ~curl~, we can verify Matchbox's running state:
#+begin_src tmate
  curl http://$LOAD_BALANCER_IP:8080
#+end_src

To test matchbox, we'll create an invalid userdata configuration for Talos, saving as ~userdata.txt~:
#+begin_src text :tangle ./userdata.txt :comments none
#!talos
#+end_src
Feel free to use a valid one.

Now let's talk to Equinix Metal to create a server pointing to the Matchbox server:
#+begin_src tmate
   packet-cli device create \
    --hostname talos-pxe-boot-test-1 \
    --plan c1.small.x86 \
    --facility sjc1 \
    --operating-system custom_ipxe \
    --project-id "$PACKET_PROJECT_ID" \
    --ipxe-script-url "http://$LOAD_BALANCER_IP:8080/ipxe?arch=amd64" \
    --userdata-file=./userdata.txt
#+end_src

In the meanwhile, we can watch the logs to see how things are:
#+begin_src tmate
  kubectl -n matchbox logs deployment/matchbox -f --tail=100
#+end_src

Looking at the logs, there should be some get requests of resources that will be used to boot the OS.

Notes:
- fun fact: you can run Matchbox on Android using [[https://f-droid.org/en/packages/com.termux/][Termux]].

*** The cluster

