blog/blog.org
**** Creating the cluster

With the template for the cluster rendered to how wish to deploy it, it's now time to apply it:
#+begin_src tmate
  kubectl create ns "$CLUSTER_NAME"
  kubectl -n "$CLUSTER_NAME" apply -f ./"$CLUSTER_NAME"-cluster-capi.yaml
#+end_src

The cluster will now be brought up, we can see the progress by taking a look at the resources:
#+begin_src tmate
  kubectl -n "$CLUSTER_NAME" get machines,clusters,packetmachines,packetclusters
#+end_src

Note: As expected, the cluster may take some time to appear and be accessible.

Not long after applying, a KubeConfig is available. Fetch the KubeConfig from the existing cluster with:
#+begin_src tmate
  kubectl -n "$CLUSTER_NAME" get secrets \
    "$CLUSTER_NAME"-kubeconfig -o=jsonpath='{.data.value}' \
    | base64 -d > $HOME/.kube/"$CLUSTER_NAME"
#+end_src

Using the KubeConfig from the new cluster, check out the status of it:
#+begin_src tmate
  kubectl --kubeconfig $HOME/.kube/"$CLUSTER_NAME" cluster-info
#+end_src

Once the APIServer is reachable, create configuration for how the Packet-Cloud-Controller-Manager should talk to Equinix-Metal:
#+begin_src tmate
  kubectl --kubeconfig $HOME/.kube/"$CLUSTER_NAME" -n kube-system \
    create secret generic packet-cloud-config \
    --from-literal=cloud-sa.json="{\"apiKey\": \"${PACKET_API_KEY}\",\"projectID\": \"${PACKET_PROJECT_ID}\"}"
#+end_src

Since we're able to talk to the APIServer, we can check how all Pods are doing:
#+name: list all Pods
#+begin_src bash :noweb yes
  <<cluster-config-env-name>>
  kubectl --kubeconfig $HOME/.kube/"$CLUSTER_NAME"\
    -n kube-system get pods
#+end_src

Listing Pods shows that everything is live and in a good state:
#+RESULTS: list all Pods
#+begin_src bash
NAMESPACE     NAME                                                     READY   STATUS    RESTARTS   AGE
kube-system   coredns-5b55f9f688-fb2cb                                 1/1     Running   0          25m
kube-system   coredns-5b55f9f688-qsvg5                                 1/1     Running   0          25m
kube-system   kube-apiserver-665px                                     1/1     Running   0          19m
kube-system   kube-apiserver-mz68q                                     1/1     Running   0          19m
kube-system   kube-apiserver-qfklt                                     1/1     Running   2          19m
kube-system   kube-controller-manager-6grxd                            1/1     Running   0          19m
kube-system   kube-controller-manager-cf76h                            1/1     Running   0          19m
kube-system   kube-controller-manager-dsmgf                            1/1     Running   0          19m
kube-system   kube-flannel-brdxw                                       1/1     Running   0          24m
kube-system   kube-flannel-dm85d                                       1/1     Running   0          24m
kube-system   kube-flannel-sg6k9                                       1/1     Running   0          24m
kube-system   kube-proxy-flx59                                         1/1     Running   0          24m
kube-system   kube-proxy-gbn4l                                         1/1     Running   0          24m
kube-system   kube-proxy-ns84v                                         1/1     Running   0          24m
kube-system   kube-scheduler-4qhjw                                     1/1     Running   0          19m
kube-system   kube-scheduler-kbm5z                                     1/1     Running   0          19m
kube-system   kube-scheduler-klsmp                                     1/1     Running   0          19m
kube-system   packet-cloud-controller-manager-77cd8c9c7c-cdzfv         1/1     Running   0          20m
kube-system   pod-checkpointer-4szh6                                   1/1     Running   0          19m
kube-system   pod-checkpointer-4szh6-talos-metal-control-plane-j29lb   1/1     Running   0          19m
kube-system   pod-checkpointer-k7w8h                                   1/1     Running   0          19m
kube-system   pod-checkpointer-k7w8h-talos-metal-control-plane-lk9f2   1/1     Running   0          19m
kube-system   pod-checkpointer-m5wrh                                   1/1     Running   0          19m
kube-system   pod-checkpointer-m5wrh-talos-metal-control-plane-h9v4j   1/1     Running   0          19m
#+end_src

With the cluster live, it's now ready for workloads to be deployed!

*** Talos Configuration

In order to manage Talos Nodes outside of Kubernetes, we need to create and set up configuration to use.

Create the directory for the config:
#+begin_src tmate
  mkdir -p $HOME/.talos
#+end_src

Discover the IP for the first controlPlane:
#+begin_src tmate
  export TALOS_ENDPOINT=$(kubectl -n "$CLUSTER_NAME" \
    get machines \
    $(kubectl -n "$CLUSTER_NAME" \
      get machines -l cluster.x-k8s.io/control-plane='' \
      --no-headers --output=jsonpath='{.items[0].metadata.name}') \
      -o=jsonpath="{.status.addresses[?(@.type=='ExternalIP')].address}" | awk '{print $2}')
#+end_src

Fetch the ~talosconfig~ from the existing cluster:
#+begin_src tmate
  kubectl get talosconfig \
    -n $CLUSTER_NAME \
    -l cluster.x-k8s.io/cluster-name=$CLUSTER_NAME \
    -o yaml -o jsonpath='{.items[0].status.talosConfig}' > $HOME/.talos/"$CLUSTER_NAME"-management-plane-talosconfig.yaml
#+end_src

Write in the configuration the endpoint IP and node IP:
#+begin_src tmate
  talosctl \
    --talosconfig $HOME/.talos/"$CLUSTER_NAME"-management-plane-talosconfig.yaml \
    config endpoint $TALOS_ENDPOINT
  talosctl \
    --talosconfig $HOME/.talos/"$CLUSTER_NAME"-management-plane-talosconfig.yaml \
    config node $TALOS_ENDPOINT
#+end_src

Now that the ~talosconfig~ has been written, try listing all containers:
#+name: list-containers-on-containerd
#+begin_src bash :noweb yes
  <<cluster-config-env-name>>
  # removing ip; omit ` | sed ...` for regular use
  talosctl --talosconfig $HOME/.talos/"$CLUSTER_NAME"-management-plane-talosconfig.yaml containers | sed -r 's/(\b[0-9]{1,3}\.){3}[0-9]{1,3}\b'/"x.x.x.x      "/
#+end_src

Here's the containers running on this particular node, in containerd (not k8s related):
#+RESULTS: list-containers-on-containerd
#+begin_src bash
NODE            NAMESPACE   ID         IMAGE                                  PID    STATUS
x.x.x.x         system      apid       talos/apid                             3046   RUNNING
x.x.x.x         system      etcd       gcr.io/etcd-development/etcd:v3.4.14   3130   RUNNING
x.x.x.x         system      networkd   talos/networkd                         2879   RUNNING
x.x.x.x         system      routerd    talos/routerd                          2888   RUNNING
x.x.x.x         system      timed      talos/timed                            2976   RUNNING
x.x.x.x         system      trustd     talos/trustd                           3047   RUNNING
#+end_src

*** Clean up

Tearing down the entire cluster and resources associated with it, can be achieved by

i. Deleting the cluster:
#+begin_src tmate
  kubectl -n "$CLUSTER_NAME" delete cluster "$CLUSTER_NAME"
#+end_src

ii. Deleting the namespace:
#+begin_src tmate
  kubectl delete ns "$CLUSTER_NAME"
#+end_src

iii. Removing local configurations:
#+begin_src tmate
  rm \
    $HOME/.talos/"$CLUSTER_NAME"-management-plane-talosconfig.yaml \
    $HOME/.kube/"$CLUSTER_NAME"
#+end_src

*** What have I learned from this?
- (always learning) how wonderful the Kubernetes community is :: there are so many knowledgable individuals who are so ready for collaboration and adoption - it doesn't matter the SIG or group.
- how modular Cluster-API is :: Cluster-API components (bootstrap, controlPlane, core, infrastructure) can be swapped out and meshed together in very cool ways.

*** Credits
Integrating Talos into this project would not be possible without help from [[https://github.com/andrewrynhard][Andrew Rynhard (Talos Systems)]], huge thanks to him for reaching out for pairing and co-authoring.

