blog/content/blog/deplying-talos-to-equinix.md


## Notes and references {#notes-and-references}

-   with the new cluster's controlPlane live and available for deployment, the iPXE server could be moved into that cluster - meaning that new servers boot from the cluster that they'll join, making it almost self-contained
-   cluster configuration as based off of [cluster-template.yaml from the cluster-api-provider-packet repo](https://github.com/kubernetes-sigs/cluster-api-provider-packet/blob/479faf06e1337b1e979cb624ca8be015b2a89cde/templates/cluster-template.yaml)
-   this post has been made to [blog.calebwoodine.com](https://blog.calebwoodbine.com/deploying-talos-and-kubernetes-with-cluster-api-on-equinix-metal), and [talos-system.com/blog](https://ii.coop/deploying-talos-and-kubernetes-with-cluster-api-on-equinix-metal/), but is also available as an [Org file](https://github.com/ii/org/blob/master/ii/equinix-metal-capi-talos-kubernetes/README.org)

---

Hope you've enjoyed the output of this project!
Thank you!
